Repository: stanislawkaczmarek1/LiftDayApp
Catalog: lib/l10n/app_*.arb
Languages: pl

# hello
source: Welcome
pl: Witaj

source: Remove exercise
pl: Usuń ćwiczenie

# confirm_remove_exercise
source: Are you sure you want to delete this exercise?
pl: Czy na pewno chcesz usunąć to ćwiczenie?

source: No
pl: Nie

source: Yes
pl: Tak

# confirm_plan_removal
source: Are you sure you want to remove your plan?
pl: Czy jestes pewny/a że chcesz usunąć swój plan?

# future_workouts_warning
source: Future workouts from the current plan will be removed from the calendar. Days from the training plan in the Plan tab will be removed. Your historical workouts will remain in the calendar.
pl: Przyszłe treningi z obecnego planu zostaną usunięte z kalendarza Dni z planu treningowego w zakładce Plan zostaną usunięte Twoje historyczne treningi pozostaną w kalendarzu

# database_info
source: Database Information
pl: Informacja o bazie danych

# scrollable_content
source: Scrollable content: Before you decide to share the database, we would like to inform you that: *The application stores data on your device, so creating a backup may be useful, for example, during device replacement. *You can send the database to your email or choose another available sharing option. *Your database contains all the data you have entered (including workouts from the calendar, plans, routines, and your own exercises). *As a user, you have full control over what you do with this data after sharing it. Clicking 'Share' means you agree to share your data.
pl: Treść przewijalna: Zanim zdecydujesz się na udostępnienie bazy danych, chcielibyśmy Cię poinformować, że: *Aplikacja składuje dane na twoim urządzeniu więc wykonanie kopii zapasowej może być przydatne np. podczas wymiany urządzenia. *Baze danych możesz np. przesłać na własnego maila lub wybrać inną dostępną opcje udostępnienia. *Twoja baza danych zawiera wszystkie wprowadzone przez Ciebie dane (m.in treningi z kalendarza, plany, rutyny, własne ćwiczenia). *Jako użytkownik masz pełną kontrolę nad tym, co robisz z tymi danymi po ich udostępnieniu. Kliknięcie "Udostępnij" oznacza, że wyrażasz zgodę na udostępnienie swoich danych.

source: Cancel
pl: Cofnij

source: Share
pl: Udostępnij

# enter_exercise_name
source: Please enter the exercise name
pl: Proszę wpisz nazwę ćwiczenia

# select_main_muscle_group
source: Please select the main muscle group
pl: Proszę wybierz główną grupę mięśniową

# enter_exercise_name_and_group
source: Please enter the exercise name and select the main muscle group
pl: Proszę wpisz nazwę ćwiczenia i wybierz główną grupę mięśniową

# operation_error
source: Sorry, an error occurred during the operation
pl: Przepraszamy wystąpił błąd podczas operacji

# select_plan_duration
source: Please select the plan duration
pl: Proszę wybierz okres trwania planu

# select_training_days
source: Please select training days
pl: Proszę wybierz dni treningowe

source: No days to load
pl: Brak dni do wczytania

# max_routines_reached
source: Maximum number of routines reached
pl: Wprowadzono maksymalną liczbę rutyn

source: Load backup
pl: Wczytaj kopie zapasową

# load_backup_message
source: After clicking 'Load', select a previously saved file named
pl: Po kliknięciu "Wczytaj" wybierz wcześniej zapisany plik o nazwie

source: Load
pl: Wczytaj

# confirm_undo
source: Are you sure you want to undo?
pl: Czy jestes pewny/a że chcesz cofnąć?

# unsaved_workouts_warning
source: Your entered workouts have not been saved yet. If you want to edit the previously entered days, you will be able to do it later in the app.
pl: Twoje wprowadzone treningi jeszcze nie zostały zapisane Jeśli chcesz edytować poprzednie wprowadzone dni będziesz mógł/mogła to zrobić później w aplikacji

source: Stay
pl: Zostań

# operation_unavailable
source: Sorry, this operation is unavailable
pl: Przepraszamy ta operacja jest niedostępna

# enter_another_name
source: Please enter a different name
pl: Proszę wprowadź inną nazwę

source: Start
pl: Rozpocznij

# choose_workout_addition_method
source: Select the way you want to add workouts
pl: Wybierz formę w jakiej chcesz dodawać treningi

# change_method_later
source: (You can always change the way you add workouts later)
pl: (Zawsze możesz zmienić formę dodawania treningów później)

# auto_assign_days
source: Automatic assignment of training days to days of the week
pl: Automatyczne przypisanie dni treningowych do dni tygodnia

# i_choose
source: Select
pl: Wybieram

source: Recommended
pl: Zalecane

# manual_assign_days
source: Manual assignment of a training day to a day of the week
pl: Ręczne wybieranie danego dnia treningowego w dany dzień tygodnia

# manual_add_exercises
source: Manual addition of exercises each day
pl: Ręczne dodawanie ćwiczeń każdego dnia

source: Finish
pl: Zakończ

source: Next day
pl: Kolejny dzień

# enter_day_name2
source: Enter the name of the day
pl: Wpisz nazwę dnia

# choose_training_days
source: Select your training days
pl: Wybierz swoje dni treningowe

source: Next
pl: Dalej

# choose_plan_duration
source: Select the duration of your training plan
pl: Wybierz okres na jaki chcesz ustawić plan treningowy

# week_1
source: 1 week
pl: 1 tydzień

# weeks_2
source: 2 weeks
pl: 2 tygodnie

# weeks_4
source: 4 weeks
pl: 4 tygodnie

# weeks_8
source: 8 weeks
pl: 8 tygodni

# choose_option
source: Choose an option
pl: Wybierz opcję

source: Data updated
pl: Zaktualizowane dane

source: Plan deleted
pl: Usunięto plan

source: Day deleted
pl: Usunięto dzień

source: My plan
pl: Mój plan

source: days left
pl: dni do końca

source: Replace
pl: Zastąp

source: Delete
pl: Usuń

source: Add plan
pl: Dodaj plan

source: Edit
pl: Edytuj

source: My routines
pl: Moje rutyny

source: + Add routine
pl: + Dodaj rutynę

source: Dark mode
pl: Tryb Ciemny

source: Language
pl: Język

source: Unit
pl: Jednostka

source: Send backup
pl: Wyślij kopie zapasową

# copied_backup
source: Successfully Copied DB
pl: Pomyślnie skopiowano bazę danych

# restore_backup
source: Resore backup
pl: Wczytaj kopie zapasową

# restored_backup
source: Successfully Restored DB
pl: Pomyślnie wczytano bazę danych

source: Workout statistics
pl: Statystyki treningowe

source: Weekly snapshot
pl: Migawka z tygodnia

source: Workouts
pl: treningi

# volume_label
source: Volume
pl: objętość

source: Workout volume
pl: Objętość treningowa

source: Muscle distribution
pl: Dystrybucja mięśni

# days_7
source: 7 days
pl: 7 dni

# days_30
source: 30 days
pl: 30 dni

# days_90
source: 90 days
pl: 90 dni

source: All time
pl: Cały okres

# weight_and_reps
source: weight and repetitions
pl: ciężar i powtórzenia

source: Select
pl: wybierz

source: Exercise list
pl: Lista ćwiczeń

# add_exercise2
source: + Add exercise
pl: + Dodaj ćwiczenie

source: Enter name:
pl: Wpisz nazwę:

source: weight and time
pl: ciężar i czas

source: Select type:
pl: Wybierz rodzaj:

# select_muscle_group
source: Select main muscle group:
pl: Wybierz główną grupę mięśniową:

source: Add
pl: Dodaj

source: Main muscle group:
pl: Główna grupa mięśniowa:

source: Search exercise
pl: Szukaj ćwiczenia

# from_app
source: From the app
pl: Z aplikacji

source: Custom
pl: Własne

# exercise_loading_error
source: Error loading exercises
pl: Błąd ładowania ćwiczeń

source: No custom exercises
pl: Brak własnych ćwiczeń

source: volume:
pl: objętość:

# enter_day_name
source: Enter the day name
pl: Wpisz nazwę dnia

# calendar_not_in_range
source: The workout calendar does not cover this date
pl: Kalendarz treningowy nie obejmuje tej daty

source: Exercise deleted
pl: Ćwiczenie usunięte

source: Select day:
pl: Wybierz dzień:

source: Add exercise
pl: Dodaj ćwiczenie

source: Load day
pl: Wczytaj dzień

source: Generate report
pl: Generuj raport

source: Set
pl: seria

source: + Add set
pl: + Dodaj serię

source: Delete set
pl: Usuń serie

source: Routines
pl: Rutyny

source: Training
pl: Trening

source: Statistics
pl: Statystyki

source: Settings
pl: Ustawienia

source: Bench press flat
pl: wyciskanie na ławce płaskiej
